10/data/attachments/2cf3f13dc50e9de2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>soap_actions_e466355c-ac6c-4c71-a4ff-8aeb04df75bd</nif:username>
            <nif:friendToBeRequested>Michelle_action_Actions_82821_7</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>